<template>
    <div>
        <v-container>
            <v-layout justify-center align-center fill-height>
                <v-flex md10>
                    <text-header>
                        Обо мне
                    </text-header>
                    <text-p>
                        Меня зовут Фадеев Егор, сейчас я учусь в <a href="https://mospolytech.ru">Московском
                        политехе</a> на направлении
                        <v-tooltip>
                            <template v-slot:activator="{ on }">
                                <span v-on="on"><i>"Прикладная информатика"</i></span>
                            </template>
                            <span>Код направления: 09.03.03</span>
                        </v-tooltip>
                        со специализацией <i>"Корпоративные информационные системы"</i>.
                        Большую часть времени уделяю web-разработке и данный сайт является одним из нескольких проектов,
                        разработанных во время обучения.
                    </text-p>
                    <h2 class="display-1 mb-3 font-weight-light">
                        Немного мыслей вслух
                    </h2>
                    <text-p>
                        Изучать программирование я начал с момента поступления в ВУЗ, в 2017 году. Всё это время я не
                        стоял на месте и открывал для себя всё новые технологии, некоторые получалось освоить,
                        некоторые остались на уровне "да, я знаю что есть такая технология". Например, я могу писать
                        какой-то код на Python 3, да я знаю как устроены некоторые сложные вещи в нём, но я не
                        использую его постоянно, потому что я не смог в своё время найти ему применение. Или же я
                        абсолютно без знания PHP сел за PHP-фреймворк Laravel и за относительно небольшое количество
                        времени (примерно за 2 месяца) освоился в нем, понял что и как в нем работает, но я не могу
                        двигаться дальше из-за полного отсутствия опыта в программировании на PHP и даже сейчас я не
                        могу "правильно" написать некоторые вещи связанные с ООП в PHP.
                    </text-p>
                    <text-p>
                        Я стараюсь следить за качеством написанного кода, но не всегда удаётся придумать
                        элегантную конструкцию с первого раза и это не всегда код, даже чаще всего это не код. Изучив
                        основные шаблоны проектирования, я вообще пришёл к мысли, что чем больше я изучаю их, тем
                        больше их описание различается в разных источниках. Поэтому я прочитал книгу банды четырех
                        про паттерны проектирования и только принял к сведению, применить на практике в "чистом" виде
                        мне так и не удалось, только лишь отдаленно напоминающие их конструкции.
                    </text-p>
                </v-flex>
            </v-layout>
        </v-container>
    </div>
</template>

<script>
import TextHeaderComponent from '../components/helpers/TextHeaderComponent';
import TextParagraphComponent from '../components/helpers/TextParagraphComponent';

export default {
    name: 'AboutPage',
    components: {
        'text-header': TextHeaderComponent,
        'text-p': TextParagraphComponent,
    }
};
</script>

<style scoped>

</style>
